---
kind: method
id: M:Autodesk.Revit.DB.ViewNavigationToolSettings.GetViewNavigationToolSettings(Autodesk.Revit.DB.Document)
source: html/bf17eb5d-094d-208a-28c9-048edbb41601.htm
---
# Autodesk.Revit.DB.ViewNavigationToolSettings.GetViewNavigationToolSettings Method

Gets the instance of the settings for the given document.

## Syntax (C#)
```csharp
public static ViewNavigationToolSettings GetViewNavigationToolSettings(
	Document pADoc
)
```

## Parameters
- **pADoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The instance of the settings for the given document.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null